use db_business 
go
create table 订购单
 (
	订购单ID  int identity(1,1) primary key,
    供应商号 varchar(50) references 供应商(供应商号),
    职工号   varchar(50) references 职工(职工号),
    订购单号      varchar(50) unique,
    订购日期     datetime ,
    金额         int
)

insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg1','or1','2003-09-02',5000)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s1','zg2','or2','2004-09-03',8600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s1','zg1','or3','2003-09-02',12000)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg2','or4','2004-09-03',16000)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg1','or5','2003-09-02',5000)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s3','zg11','or6','2004-09-03',8600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s4','zg13','or7','2003-09-02',12000)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s1','zg15','or8','2005-09-03',16600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg4','or9','2003-09-02',8120)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg8','or10','2004-09-03',5784)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s4','zg8','or11','2003-09-02',19641)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg10','or12','2005-09-03',16600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg9','or13','2003-09-02',8120)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg9','or14','2004-09-03',5784)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s4','zg7','or15','2003-09-02',19641)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg18','or16','2005-09-03',16600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg5','or17','2003-09-02',8120)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg5','or18','2004-09-03',5784)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s4','zg15','or19','2003-09-02',19641)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg15','or20','2005-09-03',16600)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s5','zg16','or21','2003-09-02',8120)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg16','or22','2004-09-03',5784)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s4','zg17','or23','2003-09-02',19641)
insert into 订购单(供应商号,职工号,订购单号,订购日期,金额) values 
   ('s2','zg18','or24','2005-09-03',16600)
